"""
7. Реализовать генератор с помощью функции с ключевым словом yield,
 создающим очередное значение.

 При вызове функции должен создаваться объект-генератор.
 Функция должна вызываться следующим образом: for el in fact(n).
 Функция отвечает за получение факториала числа,
 а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.

Подсказка: факториал числа n — произведение чисел от 1 до n.
Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""


def factorial(x):
    y = 1
    for a in range(x):
        y *= (a + 1)
        yield y


inp = int(input('Enter positive integer: '))
n = 0

for el in factorial(inp):
    n += 1
    print(f' {n}! = {el}')
